## 50.如何在Pandas中对数据进行标准化（正态化）处理？

In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler

In [2]:
data = {'A':[1,2,3,4,5],
        'B':[100,200,300,400,500],
        'C':[1000,2000,3000,4000,5000]}
df = pd.DataFrame(data)
df

   A    B     C
0  1  100  1000
1  2  200  2000
2  3  300  3000
3  4  400  4000
4  5  500  5000

In [3]:
scaler = StandardScaler().fit(df)
df_std = scaler.transform(df)
df_std

array([[-1.41421356, -1.41421356, -1.41421356],
       [-0.70710678, -0.70710678, -0.70710678],
       [ 0.        ,  0.        ,  0.        ],
       [ 0.70710678,  0.70710678,  0.70710678],
       [ 1.41421356,  1.41421356,  1.41421356]])

## 51.如何在Pandas中对数据进行归一化处理？

In [4]:
from sklearn.preprocessing import MinMaxScaler

In [5]:
data = {'A':[1,2,3,4,5],
        'B':[100,200,300,400,500],
        'C':[1000,2000,3000,4000,5000]}
df = pd.DataFrame(data)
df

   A    B     C
0  1  100  1000
1  2  200  2000
2  3  300  3000
3  4  400  4000
4  5  500  5000

In [6]:
scaler = MinMaxScaler().fit(df)
df_nom = scaler.transform(df)
df_nom

array([[0.  , 0.  , 0.  ],
       [0.25, 0.25, 0.25],
       [0.5 , 0.5 , 0.5 ],
       [0.75, 0.75, 0.75],
       [1.  , 1.  , 1.  ]])

## 52.如何在Pandas中使用透视表进行数据汇总？

In [9]:
data = {
    'Year':[2018,2018,2019,2019,2020,2020],
    'Month':[1,2,1,2,1,2],
    'Sales':[100,200,300,400,500,600]
}
df = pd.DataFrame(data=data)
df

   Year  Month  Sales
0  2018      1    100
1  2018      2    200
2  2019      1    300
3  2019      2    400
4  2020      1    500
5  2020      2    600

In [10]:
table = pd.pivot_table(df,values='Sales',index='Year',columns='Month',aggfunc='sum')

In [11]:
table

Month    1    2
Year
2018   100  200
2019   300  400
2020   500  600

## 53.如何在Pandas中使用groupby函数进行数据汇总？

In [12]:
groupby = df.groupby([
    'Year','Month'
])
result = groupby.sum()

In [13]:
result

            Sales
Year Month
2018 1        100
     2        200
2019 1        300
     2        400
2020 1        500
     2        600

## 54.如何在Pandas中使用rolling函数进行移动窗口统计？

In [14]:
ser = pd.Series(np.random.randn(10))

In [15]:
ser

0    1.260264
1   -0.165063
2   -1.520055
3   -1.759473
4   -0.576962
5    0.495707
6   -1.454073
7    1.461740
8   -1.134616
9    0.777219
dtype: float64

In [16]:
rolling_window = ser.rolling(window=3)
rolling_mean = rolling_window.mean()
rolling_mean

0         NaN
1         NaN
2   -0.141618
3   -1.148197
4   -1.285497
5   -0.613576
6   -0.511776
7    0.167791
8   -0.375650
9    0.368115
dtype: float64

## 55.如何在Pandas中使用shift函数进行时间序列处理？

In [17]:
rs = pd.Series(np.random.randn(10),index=pd.date_range('20230101',periods=10))
rs

2023-01-01    0.135595
2023-01-02    0.081095
2023-01-03   -0.033634
2023-01-04    1.532020
2023-01-05    0.843069
2023-01-06   -0.995572
2023-01-07   -0.978822
2023-01-08    0.282602
2023-01-09    0.943766
2023-01-10   -0.868942
Freq: D, dtype: float64

In [18]:
shifted = rs.shift(periods=-1)
shifted

2023-01-01    0.081095
2023-01-02   -0.033634
2023-01-03    1.532020
2023-01-04    0.843069
2023-01-05   -0.995572
2023-01-06   -0.978822
2023-01-07    0.282602
2023-01-08    0.943766
2023-01-09   -0.868942
2023-01-10         NaN
Freq: D, dtype: float64

## 56.如何在Pandas中使用 set_index 函数进行数据索引操作？

In [19]:
df = pd.DataFrame({
    'A':['foo','bar','foo','bar','foo','bar','foo','bar'],
    'B':['one','one','two','three','two','two','one','three'],
    'C':[1,2,3,4,5,6,7,8],
    'D':[8,7,6,5,4,3,2,1]
})
df

     A      B  C  D
0  foo    one  1  8
1  bar    one  2  7
2  foo    two  3  6
3  bar  three  4  5
4  foo    two  5  4
5  bar    two  6  3
6  foo    one  7  2
7  bar  three  8  1

In [21]:
indexed = df.set_index(['A','B'])
indexed

           C  D
A   B
foo one    1  8
bar one    2  7
foo two    3  6
bar three  4  5
foo two    5  4
bar two    6  3
foo one    7  2
bar three  8  1

## 57.如何在Pandas中使用 reset_index 函数进行索引重置操作？

In [22]:
reseted = indexed.reset_index()

In [23]:
reseted

     A      B  C  D
0  foo    one  1  8
1  bar    one  2  7
2  foo    two  3  6
3  bar  three  4  5
4  foo    two  5  4
5  bar    two  6  3
6  foo    one  7  2
7  bar  three  8  1

## 58.如何在Pandas中使用map函数进行数据映射操作？

In [24]:
df = pd.DataFrame({
    'name':['Alice','Bob','Charlie','David'],
    'gender':['female','male','female','male']
})
df

      name  gender
0    Alice  female
1      Bob    male
2  Charlie  female
3    David    male

In [25]:
mapping = {'male':0,'female':1}

In [26]:
df['gender'] = df['gender'].map(mapping)
df

      name  gender
0    Alice       1
1      Bob       0
2  Charlie       1
3    David       0

## 59.如何在Pandas中使用apply函数进行元素级函数应用？

In [27]:
df = pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6]
})
df

   A  B
0  1  4
1  2  5
2  3  6

In [28]:
def mulitply_by_2(x):
    return x*2

In [29]:
result = df.apply(mulitply_by_2)
result

   A   B
0  2   8
1  4  10
2  6  12

## 60.如何在Pandas中使用agg函数进行分组聚合操作？

In [36]:
df = pd.DataFrame({
    'column':[1,2,3,1,2],
    'other_column':[4,5,6,7,8]
})
df

   column  other_column
0       1             4
1       2             5
2       3             6
3       1             7
4       2             8

In [37]:
grouped = df.groupby('column')

In [38]:
grouped

In [39]:
result = grouped.agg({'other_column':'sum'})

In [40]:
result

        other_column
column
1                 11
2                 13
3                  6

## 61.如何在Pandas中使用transform函数进行分组变换操作？

In [41]:
data = pd.DataFrame({
    'A':['foo','bar','foo','bar','foo','bar','foo','bar'],
    'B':['one','one','two','three','two','two','one','three'],
    'C':[1,2,3,4,5,6,7,8],
    'D':[8,7,6,5,4,3,2,1]
})
data

     A      B  C  D
0  foo    one  1  8
1  bar    one  2  7
2  foo    two  3  6
3  bar  three  4  5
4  foo    two  5  4
5  bar    two  6  3
6  foo    one  7  2
7  bar  three  8  1

In [42]:
grouped = data.groupby('A')
grouped

In [43]:
data['C_mean'] = grouped['C'].transform(lambda x : x.mean())
data['D_mean'] = grouped['D'].transform(lambda x : x.mean())

In [44]:
data

     A      B  C  D  C_mean  D_mean
0  foo    one  1  8     4.0     5.0
1  bar    one  2  7     5.0     4.0
2  foo    two  3  6     4.0     5.0
3  bar  three  4  5     5.0     4.0
4  foo    two  5  4     4.0     5.0
5  bar    two  6  3     5.0     4.0
6  foo    one  7  2     4.0     5.0
7  bar  three  8  1     5.0     4.0

## 62.如何在Pandas中使用 stack 和 unstack 函数进行数据透视操作？

In [47]:
data = {
    'name':['Alice','Bob','Charlie'],
    'year':[2018,2019,2020],
    'sales':[100,200,300]
}
df = pd.DataFrame(data=data)
df

      name  year  sales
0    Alice  2018    100
1      Bob  2019    200
2  Charlie  2020    300

In [48]:
df.set_index('year',inplace=True)
stacked = df.stack()
stacked

year
2018  name       Alice
      sales        100
2019  name         Bob
      sales        200
2020  name     Charlie
      sales        300
dtype: object

In [49]:
unstacked = stacked.unstack()
unstacked

         name sales
year
2018    Alice   100
2019      Bob   200
2020  Charlie   300

## 63.如何在Pandas中使用 `crosstab` 函数进行数据透视操作

In [2]:
import pandas as pd
data = {
    'Sex' : ['M','M','F','F','M'],
    'Age' : [23,24,22,21,23],
    'City' : ['Beijing','Shanghai','Beijing','Shanghai','Beijing'],
    'Salary' : [5000,5500,4500,6000,4800]
}
df = pd.DataFrame(data)
df

  Sex  Age      City  Salary
0   M   23   Beijing    5000
1   M   24  Shanghai    5500
2   F   22   Beijing    4500
3   F   21  Shanghai    6000
4   M   23   Beijing    4800

In [3]:
result = pd.crosstab(index=df['Sex'], columns=df['City'],values=df['Salary'],aggfunc='mean')
result

City  Beijing  Shanghai
Sex
F      4500.0    6000.0
M      4900.0    5500.0

## 64.如何在Pandas中使用 `cut` 函数进行数据离散化操作

In [6]:
data = pd.Series([11,12,13,14,15,16,17,18,19,20])
data

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
9    20
dtype: int64

In [8]:
bins = [10,13,16,20]
labels = ['low','mid','high']
data_cut = pd.cut(data, bins=bins,labels=labels)
data_cut

0     low
1     low
2     low
3     mid
4     mid
5     mid
6    high
7    high
8    high
9    high
dtype: category
Categories (3, object): ['low' < 'mid' < 'high']

## 65.如何在Pandas中使用 `qcut` 函数进行数据等频离散化操作

In [9]:
# pd.qcut(x, q, labels=None, retbins=False, precision=3,duplicates='raise')
import numpy as np

In [10]:
data = pd.Series(np.random.randn(1000))
data

0     -1.423379
1     -0.581123
2      0.052713
3      0.925286
4      0.884698
         ...
995   -0.797286
996   -0.960596
997    0.386259
998   -0.265882
999    1.248949
Length: 1000, dtype: float64

In [11]:
bins = pd.qcut(data, q=4,labels=['bad','average','good','excellent'])
bins

0            bad
1        average
2           good
3      excellent
4      excellent
         ...
995          bad
996          bad
997         good
998      average
999    excellent
Length: 1000, dtype: category
Categories (4, object): ['bad' < 'average' < 'good' < 'excellent']

In [12]:
bins.value_counts()

bad          250
average      250
good         250
excellent    250
Name: count, dtype: int64

## 66.如何在Pandas中使用 `interpolate` 函数进行数据插值操作

In [14]:
df = pd.DataFrame({'A':[1,2,np.nan,4,5],'B':[1,2,3,np.nan,5]})
df

     A    B
0  1.0  1.0
1  2.0  2.0
2  NaN  3.0
3  4.0  NaN
4  5.0  5.0

In [15]:
df.interpolate(method='linear', inplace=True)
df

     A    B
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  5.0  5.0

## 67.如何在Pandas中使用 `bfill`和`ffill` 函数进行数据填充操作

In [16]:
df = pd.DataFrame({'A':[1,2,np.nan,4,5],'B':[1,2,3,np.nan,5]})
df

     A    B
0  1.0  1.0
1  2.0  2.0
2  NaN  3.0
3  4.0  NaN
4  5.0  5.0

In [17]:
df_bfill = df.bfill()
df_bfill

     A    B
0  1.0  1.0
1  2.0  2.0
2  4.0  3.0
3  4.0  5.0
4  5.0  5.0

In [18]:
df_ffill = df.ffill()
df_ffill

     A    B
0  1.0  1.0
1  2.0  2.0
2  2.0  3.0
3  4.0  3.0
4  5.0  5.0

## 68. 如何在Pandas中使用正则表达式进行数据过滤操作

In [19]:
data = {'Name':['Alice','Bob','Charlie','Diana','Emily'],
        'Age':[25,30,35,40,45],
        'Email':['alice@gmail.com','bob@yahoo.com','charlie@hotmail.com','diana@gmail.com','emily@hotmail.com']
}
df = pd.DataFrame(data=data)

In [20]:
df

      Name  Age                Email
0    Alice   25      alice@gmail.com
1      Bob   30        bob@yahoo.com
2  Charlie   35  charlie@hotmail.com
3    Diana   40      diana@gmail.com
4    Emily   45    emily@hotmail.com

In [21]:
data_1 = df[df['Email'].str.contains('gmail')]
data_1

    Name  Age            Email
0  Alice   25  alice@gmail.com
3  Diana   40  diana@gmail.com

In [22]:
data_2 = df[df['Email'].str.contains('gmail|hotmail',case=False)]
data_2

      Name  Age                Email
0    Alice   25      alice@gmail.com
2  Charlie   35  charlie@hotmail.com
3    Diana   40      diana@gmail.com
4    Emily   45    emily@hotmail.com

## 69.如何在 Pandas 中使用 `diff` 函数进行时间序列处理

In [23]:
dates = pd.date_range('2023-01-01',periods=5)
ts = pd.Series(np.random.randn(len(dates)),dates)
ts

2023-01-01   -0.773685
2023-01-02    1.148121
2023-01-03   -0.296009
2023-01-04    0.140840
2023-01-05    0.117686
Freq: D, dtype: float64

In [24]:
diff_ts = ts.diff()
diff_ts

2023-01-01         NaN
2023-01-02    1.921806
2023-01-03   -1.444130
2023-01-04    0.436849
2023-01-05   -0.023154
Freq: D, dtype: float64

In [25]:
diff2_ts = ts.diff().diff()
diff2_ts

2023-01-01         NaN
2023-01-02         NaN
2023-01-03   -3.365935
2023-01-04    1.880978
2023-01-05   -0.460003
Freq: D, dtype: float64

## 70.如何在 Pandas 中使用 `dropna` 函数进行数据清洗

In [28]:
data = {'Name':['Alice',np.nan,'Charlie','Diana','Emily'],
        'Age':[25,30,35,40,45],
        'Email':['alice@gmail.com',np.nan,'charlie@hotmail.com','diana@gmail.com','emily@hotmail.com']
}
df = pd.DataFrame(data=data)
df

      Name  Age                Email
0    Alice   25      alice@gmail.com
1      NaN   30                  NaN
2  Charlie   35  charlie@hotmail.com
3    Diana   40      diana@gmail.com
4    Emily   45    emily@hotmail.com

In [30]:
df.dropna(axis='index',how='any',inplace=False)

      Name  Age                Email
0    Alice   25      alice@gmail.com
2  Charlie   35  charlie@hotmail.com
3    Diana   40      diana@gmail.com
4    Emily   45    emily@hotmail.com

## 71. 如何在Pandas中使用 `join` 函数进行数据拼接操作

In [31]:
df1 = pd.DataFrame({'key':['A','B','C','D'],'value1':[1,2,3,4]})
df2 = pd.DataFrame({'key':['B','D','E','F'],'value2':[5,6,7,8]})

In [32]:
df1

  key  value1
0   A       1
1   B       2
2   C       3
3   D       4

In [33]:
df2

  key  value2
0   B       5
1   D       6
2   E       7
3   F       8

In [34]:
df = df1.join(df2.set_index('key'),on='key',how='inner')
df

  key  value1  value2
1   B       2       5
3   D       4       6

## 72. 如何在 Pandas 中使用 `get_dummies` 函数进行哑变量编码操作

In [35]:
df = pd.DataFrame({'color':['red','blue','green','red','blue']})
df

   color
0    red
1   blue
2  green
3    red
4   blue

In [36]:
dummies = pd.get_dummies(df['color'])
df = pd.concat([df,dummies],axis=1)
df

   color   blue  green    red
0    red  False  False   True
1   blue   True  False  False
2  green  False   True  False
3    red  False  False   True
4   blue   True  False  False

## 73. 如何将 DataFrame 中的某一列的数据类型转换为int类型

In [37]:
df = pd.DataFrame({'A':[1.0,2.0,3.0],'B':['4','5','6']})
df

     A  B
0  1.0  4
1  2.0  5
2  3.0  6

In [38]:
df.dtypes

A    float64
B     object
dtype: object

In [39]:
df['B'] = df['B'].astype(int)
df.dtypes

A    float64
B      int64
dtype: object

## 74. 如何将 DataFrame 中的某一列的数据类型转换为float类型

In [40]:
df = pd.DataFrame({'A':['1.2','2.3','3.4'],'B':['a','b','c']})
df

     A  B
0  1.2  a
1  2.3  b
2  3.4  c

In [41]:
df.dtypes

A    object
B    object
dtype: object

In [42]:
df['A'] = df['A'].astype(float)
df.dtypes

A    float64
B     object
dtype: object

## 75. 如何在 Pandas 中使用 `pd.to_excel` 函数进行 Excel 数据写入操作？

In [43]:
data = {'Name':['Tom','Jerry','Mickey','Donald'],
        'Age':[28,23,31,25],
        'Gender':['M','M','M','M']
}
df = pd.DataFrame(data)
df

     Name  Age Gender
0     Tom   28      M
1   Jerry   23      M
2  Mickey   31      M
3  Donald   25      M

In [44]:
df.to_excel("75test.xlsx",index=False)

## 76. 如何在 Pandas 中使用 `pd.to_json` 函数将数据保存为JSON文件？

In [45]:
df.to_json('data.json',orient='records')